-- phpMyAdmin SQL Dump
-- version 5.1.0
-- https://www.phpmyadmin.net/
--
-- 主機： 127.0.0.1
-- 產生時間： 2021-06-27 13:55:54
-- 伺服器版本： 10.4.19-MariaDB
-- PHP 版本： 8.0.6

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- 資料庫： `網設專題`
--

-- --------------------------------------------------------

--
-- 資料表結構 `search`
--

CREATE TABLE `search` (
  `id` varchar(4) NOT NULL,
  `商店名` varchar(4) DEFAULT NULL,
  `品名` varchar(10) DEFAULT NULL,
  `分類` varchar(6) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- 傾印資料表的資料 `search`
--

INSERT INTO `search` (`id`, `商店名`, `品名`, `分類`) VALUES
('A101', 'coco', '茉莉綠茶', '醇香茶品'),
('A102', 'coco', '四季春青茶', '醇香茶品'),
('A103', 'coco', '莊園紅茶', '醇香茶品'),
('A104', 'coco', '雲朵奶蓋紅茶', '醇香茶品'),
('A105', 'coco', '雲朵奶蓋綠茶', '醇香茶品'),
('A106', 'coco', '蜜香凍紅茶', '醇香茶品'),
('A107', 'coco', '蜜香凍綠茶', '醇香茶品'),
('A108', 'coco', '蜜香凍青茶', '醇香茶品'),
('A201', 'coco', '綠豆沙', '冰沙系列'),
('A202', 'coco', '芒果冰沙', '冰沙系列'),
('A203', 'coco', '芒果歐蕾', '冰沙系列'),
('A204', 'coco', '綠豆沙牛奶', '冰沙系列'),
('A301', 'coco', '百香綠茶', '鮮調果茶'),
('A302', 'coco', '鮮檸檬紅茶', '鮮調果茶'),
('A303', 'coco', '鮮檸檬綠茶', '鮮調果茶'),
('A304', 'coco', '鮮檸檬青茶', '鮮調果茶'),
('A305', 'coco', '芒果綠茶', '鮮調果茶'),
('A306', 'coco', '檸檬冬瓜露', '鮮調果茶'),
('A307', 'coco', '蕎麥冬瓜露', '鮮調果茶'),
('A308', 'coco', '蜜香檸凍紅茶', '鮮調果茶'),
('A309', 'coco', '蜜香檸凍綠茶', '鮮調果茶'),
('A310', 'coco', '蜜香檸凍青茶', '鮮調果茶'),
('A311', 'coco', '蜜香檸凍冬瓜 ', '鮮調果茶'),
('A312', 'coco', '百香雙響炮', '鮮調果茶'),
('A313', 'coco', '冬瓜西谷米', '鮮調果茶'),
('A314', 'coco', '檸檬養樂多', '鮮調果茶'),
('A315', 'coco', '檸檬霸', '鮮調果茶'),
('A316', 'coco', '鮮榨蘋果百香', '鮮調果茶'),
('A317', 'coco', '鮮香橙冰茶', '鮮調果茶'),
('A318', 'coco', '星空葡萄', '鮮調果茶'),
('A401', 'coco', '阿薩姆奶茶', '香濃奶茶'),
('A402', 'coco', '珍珠奶茶', '香濃奶茶'),
('A403', 'coco', '西谷米奶茶', '香濃奶茶'),
('A404', 'coco', '布丁奶茶', '香濃奶茶'),
('A405', 'coco', '奶茶三兄弟', '香濃奶茶'),
('A501', 'coco', '英式鮮奶茶', '濃醇鮮乳'),
('A502', 'coco', '珍珠鮮奶茶', '濃醇鮮乳'),
('A601', 'coco', '美式咖啡', '嚴選咖啡'),
('A602', 'coco', '拿鐵咖啡', '嚴選咖啡'),
('A603', 'coco', '珍珠拿鐵咖啡', '嚴選咖啡'),
('B101', '麻古', '芝芝金萱雙Q', '芝芝系列'),
('B102', '麻古', '芝芝金萱三Q', '芝芝系列'),
('B201', '麻古', '香橙果粒茶', '果粒茶系列'),
('B202', '麻古', '柳橙果粒茶', '果粒茶系列'),
('B203', '麻古', '葡萄柚果粒茶', '果粒茶系列'),
('B204', '麻古', '葡萄柚果粒蜜茶', '果粒茶系列'),
('B205', '麻古', '葡萄柚果粒多多', '果粒茶系列'),
('B206', '麻古', '奇異果果粒茶', '果粒茶系列'),
('B301', '麻古', '百香雙Q果', '鮮果茶飲'),
('B302', '麻古', '百香綠茶', '鮮果茶飲'),
('B303', '麻古', '百香多多', '鮮果茶飲'),
('B304', '麻古', '翡翠香橙', '鮮果茶飲'),
('B305', '麻古', '翡翠柳橙', '鮮果茶飲'),
('B306', '麻古', '冰萃檸檬', '鮮果茶飲'),
('B307', '麻古', '檸檬紅茶', '鮮果茶飲'),
('B308', '麻古', '檸檬綠茶', '鮮果茶飲'),
('B309', '麻古', '蜂蜜檸檬', '鮮果茶飲'),
('B310', '麻古', '檸檬多多', '鮮果茶飲'),
('B311', '麻古', '檸檬梅子', '鮮果茶飲'),
('B401', '麻古', '高山金萱茶', '原味茶'),
('B402', '麻古', '翡翠綠茶', '原味茶'),
('B403', '麻古', '錫蘭紅茶', '原味茶'),
('B404', '麻古', '金萱雙Q', '原味茶'),
('B405', '麻古', '金萱三Q', '原味茶'),
('B501', '麻古', '梅子冰茶', '獨家特調'),
('B502', '麻古', '梅子綠茶', '獨家特調'),
('B503', '麻古', '多多綠茶', '獨家特調'),
('B601', '麻古', '錫蘭奶茶', '濃醇系列'),
('B602', '麻古', '波霸奶茶', '濃醇系列'),
('B603', '麻古', '椰果奶茶', '濃醇系列'),
('B604', '麻古', '仙草凍奶茶', '濃醇系列'),
('B605', '麻古', '玫瑰奶茶', '濃醇系列'),
('B606', '麻古', '阿華田', '濃醇系列'),
('B607', '麻古', '搖滾波波奶茶', '濃醇系列'),
('B608', '麻古', '布蕾搖滾波波奶茶', '濃醇系列'),
('B609', '麻古', '珍芋奶茶', '濃醇系列'),
('B701', '麻古', '紅茶拿鐵', '香醇系列'),
('B702', '麻古', '波霸紅茶拿鐵', '香醇系列'),
('B703', '麻古', '阿華田拿鐵', '香醇系列'),
('B704', '麻古', '玫瑰紅茶拿鐵', '香醇系列'),
('B705', '麻古', '搖滾波波紅茶拿鐵', '香醇系列'),
('B706', '麻古', '布蕾搖滾波波紅茶拿鐵', '香醇系列'),
('B707', '麻古', '珍芋紅茶拿鐵', '香醇系列'),
('S101', '迷客夏', '珍珠大正紅茶拿鐵', '嚼對推薦'),
('S102', '迷客夏', '珍珠伯爵紅茶拿鐵', '嚼對推薦'),
('S103', '迷客夏', '芋圓茉香綠茶拿鐵', '嚼對推薦'),
('S104', '迷客夏', '手感芋圓芋泥鮮奶', '嚼對推薦'),
('S105', '迷客夏', '珍珠手炒黑糖鮮奶', '嚼對推薦'),
('S106', '迷客夏', '雙Q琥珀烏龍拿鐵', '嚼對推薦'),
('S107', '迷客夏', '仙草凍冬瓜茶', '嚼對推薦'),
('S201', '迷客夏', '手炒黑糖鮮奶', '綠光牧場鮮奶'),
('S202', '迷客夏', '手炒黑糖鮮奶 ', '綠光牧場鮮奶'),
('S203', '迷客夏', '嫩仙草凍奶', '綠光牧場鮮奶'),
('S204', '迷客夏', '手感芋圓鮮奶', '綠光牧場鮮奶'),
('S205', '迷客夏', '法芙娜純可可鮮奶', '綠光牧場鮮奶'),
('S206', '迷客夏', '宇治焙茶鮮奶', '綠光牧場鮮奶'),
('S207', '迷客夏', '出雲抹茶鮮奶', '綠光牧場鮮奶'),
('S208', '迷客夏', '冬瓜鮮奶', '綠光牧場鮮奶'),
('S209', '迷客夏', '珍珠鮮奶', '綠光牧場鮮奶'),
('S210', '迷客夏', '紅豆鮮奶', '綠光牧場鮮奶'),
('S211', '迷客夏', '布丁鮮奶', '綠光牧場鮮奶'),
('S212', '迷客夏', '芋頭鮮奶', '綠光牧場鮮奶'),
('S301', '迷客夏', '大正紅茶拿鐵', '牧場鮮奶茶'),
('S302', '迷客夏', '伯爵紅茶拿鐵', '牧場鮮奶茶'),
('S303', '迷客夏', '琥珀烏龍拿鐵', '牧場鮮奶茶'),
('S304', '迷客夏', '茉香緣茶拿鐵', '牧場鮮奶茶'),
('S305', '迷客夏', '原片青茶拿鐵', '牧場鮮奶茶'),
('S306', '迷客夏', '焙香大麥拿鐵', '牧場鮮奶茶'),
('S307', '迷客夏', '醇濃紅茶鮮豆奶', '牧場鮮奶茶'),
('S401', '迷客夏', '英倫伯爵紅茶', '愛茶的牛'),
('S402', '迷客夏', '大正醇香紅茶', '愛茶的牛'),
('S403', '迷客夏', '焙香決明大麥', '愛茶的牛'),
('S404', '迷客夏', '琥珀高峰烏龍', '愛茶的牛'),
('S405', '迷客夏', '茉莉原淬綠茶', '愛茶的牛'),
('S406', '迷客夏', '原片初露青茶', '愛茶的牛'),
('S407', '迷客夏', '原鄉冬瓜茶', '愛茶的牛'),
('S408', '迷客夏', '沉香烏龍', '愛茶的牛'),
('S409', '迷客夏', '小山見晴', '愛茶的牛'),
('S410', '迷客夏', '青採翠玉', '愛茶的牛'),
('S501', '迷客夏', '冬瓜麥茶', '手作特調'),
('S502', '迷客夏', '冬瓜青茶', '手作特調'),
('S503', '迷客夏', '冬瓜檸檬', '手作特調'),
('S504', '迷客夏', '冰糖洛神梅', '手作特調'),
('S505', '迷客夏', '茉香洛神冰沙', '手作特調'),
('S506', '迷客夏', '蜂農花蜜茶', '手作特調'),
('S507', '迷客夏', '水漾檸紅', '手作特調'),
('S508', '迷客夏', '水漾檸綠', '手作特調'),
('S509', '迷客夏', '冰萃檸檬', '手作特調'),
('S510', '迷客夏', '冰萃柳丁', '手作特調'),
('S511', '迷客夏', '青檸香茶', '手作特調'),
('S512', '迷客夏', '香柚綠茶', '手作特調'),
('S513', '迷客夏', '養樂多綠', '手作特調'),
('S514', '迷客夏', '柳丁綠茶', '手作特調'),
('S515', '迷客夏', '柳丁青茶', '手作特調'),
('S516', '迷客夏', '白甘蔗青茶', '手作特調');

--
-- 已傾印資料表的索引
--

--
-- 資料表索引 `search`
--
ALTER TABLE `search`
  ADD PRIMARY KEY (`id`);
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
